Revit 2024 API
FamilyTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual FamilyTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As FamilyTypeSetIterator
Visual C++
public:
virtual FamilyTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
FamilyTypeSet Class
Autodesk.Revit.DB Namespace